// Современные этапы разработки:
//1. Составление технического задания
//2. Составление технического решения
//3. Разработка
//4. Сборка проекта
//5. Тестирование
//6. Релиз

//Техническое задание: скачать картинку с сайта NASA

//Техническое решение:
//1. Получить ключ на сайте NASA
//2. Установить соединение при помощи ключа
//3. Отправить запрос и получить ответ в формате JSON
//4. Получить объект JAVA из строки JSON
//5. Получить ссылку на изображение из объекта JAVA
//6. Отправить запрос на получение изображения
//7. Получить ответ и преобразовать его в файл